avr-rust/avrd/packs/atmega/ATmega8A.atdf
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFPQFN32" caption="TQFPQFN32">
      <pin position="1" pad="PD3"/>
      <pin position="2" pad="PD4"/>
      <pin position="3" pad="GND"/>
      <pin position="4" pad="VCC"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="VCC"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="PD5"/>
      <pin position="10" pad="PD6"/>
      <pin position="11" pad="PD7"/>
      <pin position="12" pad="PB0"/>
      <pin position="13" pad="PB1"/>
      <pin position="14" pad="PB2"/>
      <pin position="15" pad="PB3"/>
      <pin position="16" pad="PB4"/>
      <pin position="17" pad="PB5"/>
      <pin position="18" pad="AVCC"/>
      <pin position="19" pad="ADC6"/>
      <pin position="20" pad="AREF"/>
      <pin position="21" pad="GND"/>
      <pin position="22" pad="ADC7"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
      <pin position="29" pad="PC6"/>
      <pin position="30" pad="PD0"/>
      <pin position="31" pad="PD1"/>
      <pin position="32" pad="PD2"/>
    </pinout>
    <pinout name="PDIP28" caption="PDIP28">
      <pin position="1" pad="PC6"/>
      <pin position="2" pad="PD0"/>
      <pin position="3" pad="PD1"/>
      <pin position="4" pad="PD2"/>
      <pin position="5" pad="PD3"/>
      <pin position="6" pad="PD4"/>
      <pin position="7" pad="VCC"/>
      <pin position="8" pad="GND"/>
      <pin position="9" pad="PB6"/>
      <pin position="10" pad="PB7"/>
      <pin position="11" pad="PD5"/>
      <pin position="12" pad="PD6"/>
      <pin position="13" pad="PD7"/>
      <pin position="14" pad="PB0"/>
      <pin position="15" pad="PB1"/>
      <pin position="16" pad="PB2"/>
      <pin position="17" pad="PB3"/>
      <pin position="18" pad="PB4"/>
      <pin position="19" pad="PB5"/>
      <pin position="20" pad="AVCC"/>
      <pin position="21" pad="AREF"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
